healt = 100
money = 0
print("Помощник: Привет! Как я вижу вы играете 1 раз.Давайте пройдем обучение!")
print("Выберите действие 1-Выйти на работу 2-Заняться спортом  3-Тест обучения.")
print("Помощник: Перед вами предлог действий.Для начала выберем тест обучения.Для этого напишите 3 ")
action = input("Помощник: Введи цифру три -- как цифру")
if action == 3 :
    print("Тест обучения пройден!")
    print("Помощник: Понял.Теперь все будущие выборы будут похожими.Теперь придется попрощаться...Но удачи!")
    print("Выберите действие 1-Выйти на работу 2-Заняться спортом.")
    action = input()
    int(action)
if action == 1:
    else:
    print("Видимо у тебя в числе ошибка.Перезапусти программу и попробуй еще раз!")














