health = 100 #здоровье= 100
money = 0 #деньги = 0

print("Помощник: Привет! Как я вижу, вы играете первый раз. Давайте пройдём обучение!")
print("Выберите действие: 1 - Выйти на работу, 2 - Заняться спортом, 3 - Тест обучения.")
print("Помощник: Перед вами список действий. Для начала выберем тест обучения. Для этого напишите 3.")

action = input("Помощник: Введи цифру 3: ")

if action == "3":
    print("Тест обучения пройден!")
    print("Помощник: Понял. Теперь все будущие выборы будут похожими. Придётся попрощаться... Но удачи!")
    money = 100
    print("У вас", money, "рублей!")
else:
    print("Неверный ввод. Попробуйте снова позже.") #ошибка команды
   
# Первый выбор вне обучения
print("Выберите действие: 1 - Выйти на работу, 2 - Заняться спортом.")
action = input("Ваш выбор: ")

if action == "1": #выйти на работу
    print("Подождите, находим вам местечко...")
    print("Отлично, мы нашли вам местечко!")
    money = 200
    print("У вас", money, "рублей!")
elif action == "2": # Спортик
    print("Выбираем вам место для тренировок...")
    print("Упс, все места заняты. Теперь ищем платные места...")
    print("Нашли! 1 тренировка будет стоить: 200 токенов.")
    print("(У вас" , money , "рублей!)")
else:
    print("Команда не распознана. Попробуйте по-другому.") #ошибка команды

# Главный игровой цикл
while True:
    print("Выберите действие: 1 - Работать, 2 - Пойти в спортзал, 3 - [BETA] Пойти домой")
    action = input("Ваш выбор: ")

    if action == "1":
        money += 610
        print("У вас", money, "рублей!")
    elif action == "2":
        print("Проверяем деньги и токены...")
        if money >= 200:
            print("Вы в спортзале. Вы тренируетесь, но теряете 200 токенов/рублей.")
            money = money + 200
            health = health + 100
            print("Итог тренировки: Здоровье —", health, "Деньги —", money)
        else:
            print("Недостаточно средств для тренировки.")
    elif action == "3":
        print("Вы дома — рядом с вами котик, и конец сюжета игры...")
        
    else:
        print("Команда не распознана. Попробуйте по-другому.")


#Simba_younger---Лёгкий код :) Можете использовать для обучения 











