health = 100
money = 0

print("Помощник: Привет! Как я вижу, вы играете первый раз. Давайте пройдём обучение!")
print("Выберите действие: 1 - Выйти на работу, 2 - Заняться спортом, 3 - Тест обучения.")
print("Помощник: Перед вами список действий. Для начала выберем тест обучения. Для этого напишите 3.")

action = input("Помощник: Введи цифру 3: ")

if action == "3":
    print("Тест обучения пройден!")
    print("Помощник: Понял. Теперь все будущие выборы будут похожими. Придётся попрощаться... Но удачи!")
else:
    print("Неверный ввод. Попробуйте снова позже.")
    

while True:
    print("Выберите действие: 1 - Выйти на работу, 2 - Заняться спортом.")
    action = input("Ваш выбор: ")

    if action == "1":
        print("Подождите, находим вам местечко...")
        print("Отлично, мы нашли вам местечко!")
    elif action == "2":
        print("Выбираем вам место для тренировок...")
        print("Упс, все места заняты. Теперь ищем платные места...")
        print("Нашли! 1 тренировка будет стоить: 200 токенов.")
    else:
        print("Команда не распознана. Попробуйте по-другому.")




#Simba_younger---Лёгкий код :) Можете использовать для обучения 














